Documents/ИнвентаризацияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ИнвентаризацияЗапасов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧленКомиссии3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИнвентаризацияЗапасов/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Процедура формирует и выводит печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
			
		Если ИмяМакета = "ИнвентаризацияЗапасов" Тогда
			
			//ВалютаПечати = Константы.ВалютаУчета.Получить();
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст ="ВЫБРАТЬ
			              |	ИнвентаризацияЗапасов.Номер,
			              |	ИнвентаризацияЗапасов.Дата КАК ДатаДокумента,
			              |	ИнвентаризацияЗапасов.Организация,
			              |	ИнвентаризацияЗапасов.Склад.Представление КАК ПредставлениеСклада,
			              |	ИнвентаризацияЗапасов.Запасы.(
			              |		НомерСтроки,
			              |		Номенклатура,
			              |		ВЫБОР
			              |			КОГДА (ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			              |				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.Наименование
			              |			ИНАЧЕ ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			              |		КОНЕЦ КАК Товар,
			              |		Количество КАК Количество,
			              |		КоличествоУчет КАК КоличествоПоУчету,
			              |		Отклонение КАК Отклонение,
			              |		Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения
			              |	),
			              |	ИнвентаризацияЗапасов.Организация.Префикс КАК Префикс,
			              |	ИнвентаризацияЗапасов.ПричинаИнвентаризации КАК ПричинаИнвентаризации,
			              |	ИнвентаризацияЗапасов.ЧленКомиссии1 КАК ФИОЧленаКомиссии2,
			              |	ИнвентаризацияЗапасов.ЧленКомиссии2 КАК ФИОЧленаКомиссии3,
			              |	ИнвентаризацияЗапасов.ЧленКомиссии3 КАК ФИОЧленаКомиссии4,
			              |	ИнвентаризацияЗапасов.ПредседательКомиссии КАК ФИОпредседателя
			              |ИЗ
			              |	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
			              |ГДЕ
			              |	ИнвентаризацияЗапасов.Ссылка = &ТекущийДокумент
			              |
			              |УПОРЯДОЧИТЬ ПО
			              |	ИнвентаризацияЗапасов.Запасы.НомерСтроки";
			Шапка = Запрос.Выполнить().Выбрать();
			
			Шапка.Следующий();
			
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			ВыборкаСтрокТовары = Шапка.Запасы.Выбрать();
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЗапасов_ИнвентаризацияЗапасов";
			
			Макет = УправлениеПечатью.ПолучитьМакет("Документ.ИнвентаризацияЗапасов.ПФ_MXL_ИнвентаризацияЗапасов");
			
			КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();	
			Макет.КодЯзыкаМакета = КодЯзыкаПечать;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ТекущийДокумент.Ссылка);
			
			ОбластьМакета.Параметры.ТекстЗаголовка = НСтр("ru='Инвентаризация запасов № ';uk='Інвентаризація запасів № '", КодЯзыкаПечать)
			+ НомерДокумента
			+ НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать)
			+ Формат(Шапка.ДатаДокумента, "Л="+КодЯзыкаПечать+"; ДЛФ=DD");
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим данные об организации и складе
			ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим шапку таблицы
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ИтогСуммы        = 0;
			ИтогСуммыПоУчету = 0;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			Пока ВыборкаСтрокТовары.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
			
			// Вывести Итого
			ОбластьМакета                        = Макет.ПолучитьОбласть("Итого");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Выводим подписи к документу
			ОбластьМакета = Макет.ПолучитьОбласть("Комиссия");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		ИначеЕсли ИмяМакета = "М21" Тогда
			
			Запрос       = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.УстановитьПараметр("Дата", ТекущийДокумент.Дата);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ИнвентаризацияЗапасов.Номер КАК НомерДокумента,
			|	ИнвентаризацияЗапасов.Дата КАК ДатаДокумента,
			|	ИнвентаризацияЗапасов.Дата КАК ДатаНачалаИнвентаризации,
			|	ИнвентаризацияЗапасов.Дата КАК ДатаОкончанияИнвентаризации,
			|	ИнвентаризацияЗапасов.Склад КАК ПредставлениеСклада,
			|	ИнвентаризацияЗапасов.Организация,
			|	ИнвентаризацияЗапасов.Склад.Представление КАК Подразделение,
			|	ИнвентаризацияЗапасов.Запасы.(
			|		НомерСтроки КАК Номер,
			|		Номенклатура,
			|		ВЫБОР
			|			КОГДА (ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))) = """"
			|				ТОГДА ИнвентаризацияЗапасов.Запасы.Номенклатура.Наименование
			|			ИНАЧЕ ВЫРАЗИТЬ(ИнвентаризацияЗапасов.Запасы.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
			|		КОНЕЦ КАК ТоварНаименование,
			|		Номенклатура.Код КАК ТоварКод,
			|		Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмеренияНаименование,
			|		Количество КАК ФактКоличество,
			|		КоличествоУчет КАК БухКоличество
			|	),
			|	ИнвентаризацияЗапасов.Номер,
			|	ИнвентаризацияЗапасов.Организация.Префикс КАК Префикс,
			|	ИнвентаризацияЗапасов.Организация.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
			|	ИнвентаризацияЗапасов.ПредседательКомиссии КАК ФИОпредседателя,
			|	ИнвентаризацияЗапасов.ЧленКомиссии1 КАК ФИОЧленаКомиссии2,
			|	ИнвентаризацияЗапасов.ЧленКомиссии2 КАК ФИОЧленаКомиссии3,
			|	ИнвентаризацияЗапасов.ЧленКомиссии3 КАК ФИОЧленаКомиссии4
			|ИЗ
			|	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
			|ГДЕ
			|	ИнвентаризацияЗапасов.Ссылка = &ТекущийДокумент
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИнвентаризацияЗапасов.Запасы.НомерСтроки";
			Шапка = Запрос.Выполнить().Выбрать();
			
			Шапка.Следующий();
			
			НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
			
			ВыборкаСтрокТовары = Шапка.Запасы.Выбрать();
			
			// Зададим параметры макета по умолчанию
			ТабличныйДокумент.ПолеСверху              = 5;
			ТабличныйДокумент.ПолеСлева               = 0;
			ТабличныйДокумент.ПолеСнизу               = 0;
			ТабличныйДокумент.ПолеСправа              = 0;
			ТабличныйДокумент.РазмерКолонтитулаСверху = 5;
			ТабличныйДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
			
			ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризационнаяОпись_М21";
			Макет       = УправлениеПечатью.ПолучитьМакет("Документ.ИнвентаризацияЗапасов.ПФ_MXL_ИнвентаризационнаяОпись_М21");
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.ПредставлениеОрганизации = Шапка.Организация;
			
			ОбластьМакета.Параметры.ОрганизацияПоЕДРПОУ      = Шапка.КодПоЕДРПОУ;
			ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
			ОбластьМакета.Параметры.ПредставлениеСклада      = Шапка.ПредставлениеСклада;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Ном = 0;
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			// Выводим многострочную часть документа
			Пока ВыборкаСтрокТовары.Следующий() Цикл
				
				Ном = Ном + 1;
				СтрокаТаблицы   = Макет.ПолучитьОбласть("Строка");
				СтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрокТовары);
				СтрокаТаблицы.Параметры.ТоварНаименование = ВыборкаСтрокТовары.Номенклатура;
				
				СтрокаТаблицы.Параметры.Номер = Ном;
				
				ТабличныйДокумент.Вывести(СтрокаТаблицы);
				
			КонецЦикла;
			
			// Выводим подвал документа
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОписи");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.КоличествоПорядковыхНомеровНаСтраницеПрописью = ЧислоПрописью(ВыборкаСтрокТовары.Количество(), "Л = uk", ",,,,,,,,0");
			ОбластьМакета.Параметры.НомерКонца = ВыборкаСтрокТовары.Количество();
			
			ОбластьМакета.Параметры.ДатаДокумента 	= Шапка.ДатаДокумента;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризацияЗапасов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнвентаризацияЗапасов", "Инвентаризация запасов", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ИнвентаризацияЗапасов"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М21") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "М21", "Инвентаризационная опись (М21)", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "М21"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПечати(знач МассивДокументов, знач МассивИменМакетов) Экспорт
	
	ДанныеПоВсемОбъектам = Новый Соответствие;
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	ТипыМакетов = Новый Соответствие;
	
	Возврат Новый Структура("Данные, Макеты",
	ДанныеПоВсемОбъектам,
	Новый Структура("ОписаниеОбластей, ТипыМакетов, ДвоичныеДанныеМакетов",
	ОписаниеОбластей,
	ТипыМакетов,
	ДвоичныеДанныеМакетов));
	
КонецФункции
